﻿﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**     5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093            **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//**********************************************************************
// Revision History
// ----------------
// $Log: $
// 
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:	AmiTcgPlatfromDxeString.uni
//
// Description:	String definitions for PPI interface
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#langdef en-US "English"

#string TPM_CLEAR_STR                 #language en-US "A configuration change was requested to Clear this computer's TPM (Trusted Platform Module)\n\n"
#string TPM_PPI_HEAD_STR              #language en-US "A configuration change was requested to allow the Operating System to Clear the computer's TPM (Trusted Platform Module) without asking for user confirmation in the future.\n\n"

#string TPM_ACCEPT_KEY                #language en-US "Press F10 " 
#string TPM_CAUTION_KEY               #language en-US "Press F12 " 
#string TPM_REJECT_KEY                #language en-US "to Clear the TPM \nPress ESC to reject this change request and continue\n"

#string TPM_CLEAR                     #language en-US "clear"

#string TPM_NO_PPI_INFO               #language en-US "A configuration change was requested to approve future Operating System requests "

#string TPM_WARNING_CLEAR             #language en-US "WARNING: Clearing erases information stored on the TPM. You will lose all created keys and access to data encrypted by these keys. "
#string TPM_NOTE_CLEAR                #language en-US "NOTE: This action does not clear the TPM, but by approving this configuration change, future actions to clear the TPM will not require user confirmation.\n\n"
#string STR_TCG_BLANK                   #language en-US "                                                                                "

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**     5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093            **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************